## Joining
join() is simpler syntax for combining on index (or keys)

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    'Name' : ['Kainat', 'Alice', 'Zoya'],
    'Age' : [23, 45, 33]
}, index=[1, 2, 3])


df2 = pd.DataFrame({
    'Country' : ['Pakistan', 'USA', 'Bangladesh'],
}, index=[2, 3, 4])

df1.join(df2)

     Name  Age   Country
1  Kainat   23       NaN
2   Alice   45  Pakistan
3    Zoya   33       USA

In [5]:
df1.join(df2, how='right')

    Name   Age     Country
2  Alice  45.0    Pakistan
3   Zoya  33.0         USA
4    NaN   NaN  Bangladesh

In [6]:
df1.join(df2, how='outer')

     Name   Age     Country
1  Kainat  23.0         NaN
2   Alice  45.0    Pakistan
3    Zoya  33.0         USA
4     NaN   NaN  Bangladesh